Masmiseim36/nxpSDK/boards/mimxrt700evk/ezhv_examples/flexio_dvp/cm33_core0/pin_mux.c
    /* PORT2 PIN6 (coords: H6) is configured as FLEXIO_D6 => D0, J53-16 */
    IOPCTL_PinMuxSet(2U, 6U, flexio_config);

    /* PORT2 PIN7 (coords: G6) is configured as FLEXIO_D7 => D1, J53-15 */
    IOPCTL_PinMuxSet(2U, 7U, flexio_config);

    /* PORT2 PIN8 (coords: G4) is configured as FLEXIO_D8 => D2, J53-14 */
    IOPCTL_PinMuxSet(2U, 8U, flexio_config);

    /* PORT2 PIN9 (coords: G5) is configured as FLEXIO_D9 => D3, J53-13 */
    IOPCTL_PinMuxSet(2U, 9U, flexio_config);

    /* PORT2 PIN10 (coords: F5) is configured as FLEXIO_D10 => D4, J53-12 */
    IOPCTL_PinMuxSet(2U, 10U, flexio_config);

    /* PORT2 PIN11 (coords: F3) is configured as FLEXIO_D11 => D5, J53-11 */
    IOPCTL_PinMuxSet(2U, 11U, flexio_config);

    /* PORT2 PIN12 (coords: E3) is configured as FLEXIO_D12 => D6, J53-10 */
    IOPCTL_PinMuxSet(2U, 12U, flexio_config);

    /* PORT2 PIN13 (coords: E4) is configured as FLEXIO_D13 => D7, J53-09 */
    IOPCTL_PinMuxSet(2U, 13U, flexio_config);

    /* PORT2 PIN15 (coords: D3) is configured as FLEXIO_D15 => PCLK, J53-7 */
    IOPCTL_PinMuxSet(2U, 15U, flexio_config);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPsRamPins_Xspi2
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPsRamPins_Xspi2(void)
{

    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

	const uint32_t port4_pin0_config = (
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Normal drive */
                                        IOPCTL_PIO_DRIVE_100OHM |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);

    IOPCTL_PinMuxSet(4U, 0U, port4_pin0_config);

    const uint32_t port4_pin1_config = (
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Normal drive */
                                        IOPCTL_PIO_DRIVE_100OHM |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);

    IOPCTL_PinMuxSet(4U, 1U, port4_pin1_config);

    const uint32_t port4_pin2_config = (
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Normal drive */
                                        IOPCTL_PIO_DRIVE_100OHM |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);

    IOPCTL_PinMuxSet(4U, 2U, port4_pin2_config);

    const uint32_t port4_pin3_config = (
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Normal drive */
                                        IOPCTL_PIO_DRIVE_100OHM |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);

    IOPCTL_PinMuxSet(4U, 3U, port4_pin3_config);

    const uint32_t port4_pin4_config = (
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Normal drive */
                                        IOPCTL_PIO_DRIVE_100OHM |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);

